In [1]:
# "pandas" is the module name
# "pd" is the alias for "pandas"

import pandas as pd

In [4]:
# Creating a new dataFrame from list of dictionaries

df_lod = pd.DataFrame([{"City":"Jersey City","State":"New Jersey"},
                      {"City":"Morristown","State":"New Jersey"},
                      {"City":"St. Louis","State":"Missoury"},
                      {"City":"Rome City","State":"Indiana"}])
df_lod

          City       State
0  Jersey City  New Jersey
1   Morristown  New Jersey
2    St. Louis    Missoury
3    Rome City     Indiana

In [3]:
# Creating a new dataFrame from dictionary of lists
# NOTE this will return an error
df_dol = pd.DataFrame({"City":"Doylestown", "State":"Pennsylvania"})

ValueError: If using all scalar values, you must pass an index

In [5]:
# Creating a new dataFrame from dictionary of lists
# NOTE this is corrected
df_dol = pd.DataFrame({"City":["Doylestown"], "State":["Pennsylvania"]})
df_dol

         City         State
0  Doylestown  Pennsylvania

In [7]:
import numpy as np

In [9]:
np.random.randint(20000,300000)

81323

In [10]:
df_1 = pd.DataFrame({"case number":range(10,50),"accounts":[np.random.randint(200000,300000) for i in range(10,50)]})

In [12]:
df_2 = pd.DataFrame({"case number":range(10,50),"value":["$"+str(np.random.randint(200,1000000)) for i in range(10,50)]})
df_2.head()

   case number    value
0           10  $625861
1           11  $645076
2           12  $249226
3           13  $746538
4           14  $162704

In [13]:
df_3 = df_2.set_index("case number").join(df_1.set_index("case number"))
df_3.head()

               value  accounts
case number
10           $625861    239039
11           $645076    234867
12           $249226    296699
13           $746538    233057
14           $162704    266379

In [14]:
df_2['value'].str.replace("$","",regex=True).map(float)
df_2['Value (float)'] = df_2['value'].str.replace("$","",regex=True).map(float)
df_2.head()

   case number    value  Value (float)
0           10  $625861       625861.0
1           11  $645076       645076.0
2           12  $249226       249226.0
3           13  $746538       746538.0
4           14  $162704       162704.0

In [15]:
# Creating categories using bins

#bins are length N
bins = [200,100000,300000,500000,700000,900000,1000000]

#group labels (categories) are length N-1
group_labels=["200-100K","100K-300K","300K-500K","500K-700K","700K-900K","900K-1M"]

df_2["Wealth ranges"] = pd.cut(df_2['Value (float)'],bins,labels=group_labels)
df_2.head()

   case number    value  Value (float) Wealth ranges
0           10  $625861       625861.0     500K-700K
1           11  $645076       645076.0     500K-700K
2           12  $249226       249226.0     100K-300K
3           13  $746538       746538.0     700K-900K
4           14  $162704       162704.0     100K-300K

In [16]:
# Sorting these fields by value ascending
df_2.sort_values("Value (float)")

    case number    value  Value (float) Wealth ranges
16           26   $36318        36318.0      200-100K
27           37   $72468        72468.0      200-100K
29           39   $82319        82319.0      200-100K
34           44  $155265       155265.0     100K-300K
4            14  $162704       162704.0     100K-300K
31           41  $180812       180812.0     100K-300K
2            12  $249226       249226.0     100K-300K
33           43  $282973       282973.0     100K-300K
37           47  $289265       289265.0     100K-300K
11           21  $300250       300250.0     300K-500K
39           49  $327966       327966.0     300K-500K
36           46  $333181       333181.0     300K-500K
12           22  $361980       361980.0     300K-500K
13           23  $371990       371990.0     300K-500K
30           40  $401539       401539.0     300K-500K
10           20  $455888       455888.0     300K-500K
8            18  $456604       456604.0     300K-500K
26           36  $492081       492081.0     300K-500K
38           48  $511103       511103.0     500K-700K
24           34  $517900       517900.0     500K-700K
9            19  $536423       536423.0     500K-700K
20           30  $583309       583309.0     500K-700K
17           27  $604726       604726.0     500K-700K
0            10  $625861       625861.0     500K-700K
1            11  $645076       645076.0     500K-700K
7            17  $703349       703349.0     700K-900K
25           35  $703774       703774.0     700K-900K
18           28  $706095       706095.0     700K-900K
15           25  $709800       709800.0     700K-900K
3            13  $746538       746538.0     700K-900K
5            15  $795471       795471.0     700K-900K
14           24  $813801       813801.0     700K-900K
19           29  $824971       824971.0     700K-900K
22           32  $838911       838911.0     700K-900K
28           38  $842616       842616.0     700K-900K
23           33  $843325       843325.0     700K-900K
35           45  $845932       845932.0     700K-900K
21           31  $917070       917070.0       900K-1M
6            16  $983177       983177.0       900K-1M
32           42  $994357       994357.0       900K-1M

In [17]:
# Sorting these fields by value descending
df_2.sort_values("Value (float)",ascending=False)

    case number    value  Value (float) Wealth ranges
32           42  $994357       994357.0       900K-1M
6            16  $983177       983177.0       900K-1M
21           31  $917070       917070.0       900K-1M
35           45  $845932       845932.0     700K-900K
23           33  $843325       843325.0     700K-900K
28           38  $842616       842616.0     700K-900K
22           32  $838911       838911.0     700K-900K
19           29  $824971       824971.0     700K-900K
14           24  $813801       813801.0     700K-900K
5            15  $795471       795471.0     700K-900K
3            13  $746538       746538.0     700K-900K
15           25  $709800       709800.0     700K-900K
18           28  $706095       706095.0     700K-900K
25           35  $703774       703774.0     700K-900K
7            17  $703349       703349.0     700K-900K
1            11  $645076       645076.0     500K-700K
0            10  $625861       625861.0     500K-700K
17           27  $604726       604726.0     500K-700K
20           30  $583309       583309.0     500K-700K
9            19  $536423       536423.0     500K-700K
24           34  $517900       517900.0     500K-700K
38           48  $511103       511103.0     500K-700K
26           36  $492081       492081.0     300K-500K
8            18  $456604       456604.0     300K-500K
10           20  $455888       455888.0     300K-500K
30           40  $401539       401539.0     300K-500K
13           23  $371990       371990.0     300K-500K
12           22  $361980       361980.0     300K-500K
36           46  $333181       333181.0     300K-500K
39           49  $327966       327966.0     300K-500K
11           21  $300250       300250.0     300K-500K
37           47  $289265       289265.0     100K-300K
33           43  $282973       282973.0     100K-300K
2            12  $249226       249226.0     100K-300K
31           41  $180812       180812.0     100K-300K
4            14  $162704       162704.0     100K-300K
34           44  $155265       155265.0     100K-300K
29           39   $82319        82319.0      200-100K
27           37   $72468        72468.0      200-100K
16           26   $36318        36318.0      200-100K

In [20]:
# Grouping data by weath
#df_2.groupby("Wealth ranges").count()
#df_2.groupby("Wealth ranges").sum()
df_2.groupby("Wealth ranges").mean()

               case number  Value (float)
Wealth ranges
200-100K         34.000000   63701.666667
100K-300K        33.500000  220040.833333
300K-500K        30.555556  389053.222222
500K-700K        25.571429  574914.000000
700K-900K        27.833333  781215.250000
900K-1M          29.666667  964868.000000